Revit 2027 API
MultiReferenceAnnotationOptions.SetElementsToDimension Method
 Sets the elements which the dimension will witness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetElementsToDimension(
	ICollection<ElementId> elementsToDimension
)
Public Sub SetElementsToDimension (
	elementsToDimension As ICollection(Of ElementId)
)
public:
void SetElementsToDimension(
	ICollection<ElementId^>^ elementsToDimension
)
member SetElementsToDimension :
        elementsToDimension : ICollection<ElementId> -> unit
Parameters
elementsToDimension ICollection<ElementId>
 The elements which the dimension will witness.
Exceptions
Exception | Condition
ArgumentException |  some elements do not match the reference category required by the MultiReferenceAnnotationType.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The MultiReferenceAnnotationType assigned to the options can't create MultiReferenceAnnotations by element.
Remarks
 The dimension will automatically find geometric references in the elements.
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace